src/Documents/ИзменениеАссортиментаПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИзменениеАссортиментаПодразделения</Name>
			<Comment>Изменение ассортимента подразделения</Comment>
			<BasedOn>
				<xr:Item>Document.ИзменениеАссортиментаПодразделения</xr:Item>
				<xr:Item>Catalog.ПрайсЛистыКонтрагентов</xr:Item>
				<xr:Item>Document.ИзменениеСодержанияГруппАссортимента</xr:Item>
				<xr:Item>Document.СогласованиеЗакупочныхЦен</xr:Item>
				<xr:Item>Document.ИзменениеГруппАссортиментаПодразделения</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>InformationRegister.ОграничениеАссортиментаПодразделения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип розничных цен списания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВводаВАссортимент</Name>
					<Comment>Дата ввода товара в ассортимент</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласованиеЗакупочныхЦен</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеГруппАссортиментаПодразделения</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеСодержанияГруппАссортимента</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАссортиментаПодразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>итФормат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Списываемые товары</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценки</Name>
							<Comment>Процент наценки для автоматического формирования цены продажи</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРозничная</Name>
							<Comment>Розничная цена для переоценки остатков перед списанием</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйАссортимент</Name>
							<Comment>Товар вводится в базовый ассортимент</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАссортимента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыАссортимента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Подразделения, для которых устанавливается ассортимент</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Comment>Подразделение компании для которого изменяется ассортимент данным документом</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ОграничениеАссортиментаПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОграничениеАссортиментаПодразделения</Name>
			<Comment>Ограничение ассортимента подразделения компании</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние товара в ассортименте подразделения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияТовараВАссортименте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатурной позиции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Comment>Процент наценки для автоматического формирования цены продажи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаРозничная</Name>
					<Comment>Розничная цена для переоценки остатков перед списанием</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по номенклатурной позиции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйАссортимент</Name>
					<Comment>Товар вводится в базовый ассортимент</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАссортимента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>итФорматАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Не хранится на складах, используется для отнесения суммы услуг на себестоимость или доходы и расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
					<Comment>Вид ТМЦ, хранимый на складе и возвращаемый поставщику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
					<Comment>Вид ТМЦ не хранимый на складе и предназначенный для группового прихода / расхода номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивы</Name>
					<Comment>Прочие активы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
					<Comment>Продукция</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СостоянияТовараВАссортименте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияТовараВАссортименте</Name>
			<Comment>Состояния товара в ассортименте подразделения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Введен</Name>
					<Comment>Введен в ассортимент подразделения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выведен</Name>
					<Comment>Выведен из ассортимента подразделения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
					<Comment>Временно выведен из ассортимента подразделения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИзменениеАссортиментаПодразделения/Ext/ManagerModule.bsl
// Модуль менеджера документа "Изменение ассортимента подразделения"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ВалютаДокумента");
	ОбязательныеРеквизиты.Добавить("КурсДокумента");
	ОбязательныеРеквизиты.Добавить("ТипЦен");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	ОбязательныеРеквизиты.Добавить("ДатаВводаВАссортимент");
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Товары");
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("Товары.Номенклатура");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;

КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеТовары = Новый Массив();
	УникальныеТовары.Добавить("Номенклатура");
	
	// Структура уникальных реквизитов табличных частей
	УникальныеТабличныеЧасти = Новый Структура();
	УникальныеТабличныеЧасти.Вставить("Товары",УникальныеТовары);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Товары.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	Если НЕ Объект.ДатаВводаВАссортимент = Объект.Дата Тогда
		ПараметрыДействия.Вставить("ТребуетсяИзменитьДатуВвода", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	ТипЦенРеализации = Объект.ПодразделениеКомпании.ТипЦенРеализации;
	Если НЕ ЗначениеЗаполнено(ТипЦенРеализации) Тогда
		ТипЦенРеализации = Объект.ТипЦен;
	КонецЕсли;
	
	Если ЕстьРеквизит(Объект,"РекомендуемыйПроцентНаценки","Товары") Тогда
		ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитРекомендуемыйПроцентНаценки(Объект, ТипЦенРеализации, Неопределено, "РекомендуемыйПроцентНаценки", "Товары", ПараметрыДействия);
	КонецЕсли;
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Тип цен".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТипЦенПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ТипЦенПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТипЦенПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Валюта".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВалютаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс документа".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КурсДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КурсДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КурсДокументаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия);
	
	// Проверим, имеют ли смысл дальнейшие действия
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
		Возврат;
	КонецЕсли;
	
	ТипЦенРеализации = ЦенообразованиеСервер.ПолучитьТипЦенПодразделения(Объект, Объект.ПодразделениеКомпании);
	
	// Приватный расчет розничной цены
	ЦенаЗакупки = ЦенообразованиеСервер.ПересчитатьВВалютуРозничнойЦены(Объект, ТипЦенРеализации, Строка.Номенклатура, Строка.Цена);
	
	Строка.ПроцентНаценки = ОбработкаТабличнойЧастиТовары.ПолучитьПроцентНаценкиСтроки(Строка.Номенклатура, ТипЦенРеализации, Объект.Дата);
	Строка.ЦенаРозничная  = ЦенаЗакупки + (ЦенаЗакупки*Строка.ПроцентНаценки/100);
	
	Если ЕстьРеквизит(Объект,"РекомендуемыйПроцентНаценки","Товары") Тогда
		ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитРекомендуемыйПроцентНаценки(Объект, ТипЦенРеализации, Строка, "РекомендуемыйПроцентНаценки", "Товары", ПараметрыДействия);
	КонецЕсли;
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЦенаПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ТипЦенРеализации = ЦенообразованиеСервер.ПолучитьТипЦенПодразделения(Объект, Объект.ПодразделениеКомпании);
	
	// Приватный расчет розничной цены
	ЦенаЗакупки = ЦенообразованиеСервер.ПересчитатьВВалютуРозничнойЦены(Объект, ТипЦенРеализации, Строка.Номенклатура, Строка.Цена);
	Строка.ЦенаРозничная = ЦенаЗакупки + (ЦенаЗакупки*Строка.ПроцентНаценки/100);
	
КонецПроцедуры // ТоварыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Процент наценки" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыПроцентНаценкиПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ТипЦенРеализации = ЦенообразованиеСервер.ПолучитьТипЦенПодразделения(Объект, Объект.ПодразделениеКомпании);
	
	// Приватный расчет розничной цены
	ЦенаЗакупки = ЦенообразованиеСервер.ПересчитатьВВалютуРозничнойЦены(Объект, ТипЦенРеализации, Строка.Номенклатура, Строка.Цена);
	
	Строка.ЦенаРозничная = ЦенаЗакупки + (ЦенаЗакупки*Строка.ПроцентНаценки/100);
	
КонецПроцедуры // ТоварыПроцентНаценкиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена (розничная)" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЦенаРозничнаяПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	Если Строка.Цена = 0 Тогда
		Строка.ПроцентНаценки = 0;
	КонецЕсли;
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ТипЦенРеализации = ЦенообразованиеСервер.ПолучитьТипЦенПодразделения(Объект, Объект.ПодразделениеКомпании);
	
	// Приватный расчет розничной цены
	ЦенаЗакупки = ЦенообразованиеСервер.ПересчитатьВВалютуРозничнойЦены(Объект, ТипЦенРеализации, Строка.Номенклатура, Строка.Цена);
	
	Строка.ПроцентНаценки = ((Строка.ЦенаРозничная-ЦенаЗакупки)/ЦенаЗакупки)*100;
	
КонецПроцедуры // ТоварыЦенаРозничнаяПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена (розничная)" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.ИзменениеАссортиментаПодразделения",
		"ПФ_MXL_ИзменениеАссортиментаПодразделения",
		НСтр("ru = 'Изменение ассортимента подразделения'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ИзменениеАссортиментаПодразделения") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ИзменениеАссортиментаПодразделения",
															НСтр("ru = 'Изменение ассортимента подразделения'"),
															ПечатьИзменениеАссортиментаПодразделения(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;	
КонецПроцедуры // Печать()

// Формирует печатную форму "ИзменениеАссортиментаПодразделения"
//
Функция ПечатьИзменениеАссортиментаПодразделения(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИзменениеАссортиментаПодразделения_ИзменениеАссортиментаПодразделения";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИзменениеАссортиментаПодразделения.ПФ_MXL_ИзменениеАссортиментаПодразделения");
		
		ОбластьШапкаТаблицы    = УправлениеПечатьюПлатформа.ПривестиМакетПечатнойФормы(Макет, Документ);
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
		ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
		ОбластьИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьПодвал          = Макет.ПолучитьОбласть("Подвал");
		
		// дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		// вывод заголовка документа
		ОбластьЗаголовок.Параметры.Заполнить(Документ);
		ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ, Документ.ХозОперация.Наименование);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		Если ЗначениеЗаполнено(Документ.ПодразделениеКомпании) И ЗначениеЗаполнено(Документ.ПодразделениеКомпании.КПП) Тогда
			СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
			ОбластьЗаголовок.Параметры.ПредставлениеОрганизации	= СтрЗаменить(СтрокаПредставления, ОбщегоНазначения.ПолучитьКППНаДату(Документ.Организация, ДатаДокумента), ОбщегоНазначения.ПолучитьКППНаДату(Документ.ПодразделениеКомпании, ДатаДокумента));
		Иначе	
			ОбластьЗаголовок.Параметры.ПредставлениеОрганизации	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
		КонецЕсли;
		ОбластьЗаголовок.Параметры.ПредставлениеПодразделения = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.ПодразделениеКомпании,,,,ДатаДокумента);
				
		// выводим свойства
		УправлениеПечатьюПлатформа.ЗаполнитьСвойствамиОбъекта(ОбластьЗаголовок, Документ);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);

		// готовим шапку
		НомерСтраницы = 2; НомерСтраницыПред = 2;
		СтруктураИтоговПоСтранице = Новый Структура();
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		
		// готовим области строки
		ВыборкаТабличнойЧасти = Документ.Товары;
		Для каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
			СтруктураСтроки = УправлениеПечатьюПлатформа.ЗаполнитьПредставлениеДанныхТоварнойСтроки(СтрокаТЧ,Документ);
			СтруктураСтроки.Вставить("ПроцентНаценки",СтрокаТЧ.ПроцентНаценки);
			СтруктураСтроки.Вставить("СтавкаНДС",УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(СтрокаТЧ.СтавкаНДС));
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			
			// доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если Документ.Товары.Индекс(СтрокаТЧ) = Документ.Товары.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ, мсвДопОбластиПодвала);
			// инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура();
				НомерСтраницыПред		  = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			КонецЕсли;
			
		КонецЦикла;
		
		// выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтогоПоСтранице,СтруктураИтоговПоСтранице,Документ);
		КонецЕсли;

		// Выводим представления и расшифровки подписей
		ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"Ответственный","Ответственный"));
		ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"Получил","Получил"));
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
		
		// отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции //ПечатьИзменениеАссортиментаПодразделения()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыУстановитьРекомендуемуюНаценку", "ЗаполнитьТоварныйРеквизит", "Товары", НСтр("ru = 'Установить рекомендуемую наценку'"),,,,,Ложь, Истина);
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыУстановитьБазовыйАссортимент", "ЗаполнитьТоварныйРеквизит", "Товары", НСтр("ru = 'Установить флаг базовый ассортимент'"),,,,,Ложь, Истина);
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыСнятьБазовыйАссортимент", "ЗаполнитьТоварныйРеквизит", "Товары", НСтр("ru = 'Снять флаг базовый ассортимент'"),,,,,Ложь, Истина);
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьСкладскимиОстатками",, "Товары", НСтр("ru = 'Заполнить складскими остатками'"));
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьВсейНоменклатурой", "ТоварыЗаполнитьНоменклатурой", "Товары", НСтр("ru = 'Заполнить всей номенклатурой'"));
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаНоменклатуры","Справочник.Номенклатура.Форма.ФормаВыбораГруппы",,, Истина, НСтр("ru = 'Необходимо выбрать группу номенклатуры.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоГруппеНоменклатуры", "ТоварыЗаполнитьНоменклатурой", "Товары", НСтр("ru = 'Заполнить по группе номенклатуры'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ВидПрайсЛиста","Справочник.ВидыПрайсЛистов.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать вид прайс-листа контрагента.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоПрайсЛисту",, "Товары", НСтр("ru = 'Заполнить по прайс-листу'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ВидПрайсЛиста","Справочник.ВидыПрайсЛистов.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать вид прайс-листа контрагента.'")); 
	Отбор = Новый Структура ("Владелец", "ВидПрайсЛиста");
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаПрайсЛиста","Справочник.ПрайсЛист.Форма.ФормаВыбораГруппы", Новый Структура("Отбор,ОбработкаВДокументе,РежимВыбора", Отбор,ИСТИНА, ИСТИНА),, Истина, НСтр("ru = 'Необходимо выбрать группу прайс-листа.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоГруппеПрайсЛиста", "ТоварыЗаполнитьПоПрайсЛисту", "Товары", НСтр("ru = 'Заполнить по группе прайс-листа'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ПрайсЛистКонтрагента","Справочник.ПрайсЛистыКонтрагентов.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать группу прайс-лист контрагента.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоПрайсЛистуКонтрагента", "ТоварыЗаполнитьПоПрайсЛистуКонтрагента", "Товары", НСтр("ru = 'Заполнить по прайс-листу контрагента'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "СогласованиеЗакупочныхЦен", "Документ.СогласованиеЗакупочныхЦен.ФормаВыбора",,, Истина, НСтр("ru = 'Необходимо выбрать согласование закупочных цен.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоСогласованиюЗакупочныхЦен", "ТоварыЗаполнитьПоСогласованиюЗакупочныхЦен", "Товары", НСтр("ru = 'Заполнить по согласованию закупочных цен'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "Подразделение", "Справочник.ПодразделенияКомпании.ФормаВыбора", ,, Истина, НСтр("ru = 'Необходимо выбрать подразделение ассортимента.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоАссортиментуПодразделения", "ТоварыЗаполнитьПоАссортиментуПодразделения", "Товары", НСтр("ru = 'Заполнить по ассортименту подразделения'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "Подразделение", "Справочник.ПодразделенияКомпании.ФормаВыбора",,, Истина, НСтр("ru = 'Необходимо выбрать подразделение ассортимента.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоБазовомуАссортиментуПодразделения", "ТоварыЗаполнитьПоАссортиментуПодразделения", "Товары", НСтр("ru = 'Заполнить по базовому ассортименту подразделения'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаНоменклатуры","Справочник.Номенклатура.Форма.ФормаВыбораГруппы",,, Истина, НСтр("ru = 'Необходимо выбрать группу номенклатуры.'"));
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "Подразделение", "Справочник.ПодразделенияКомпании.ФормаВыбора", ,, Истина, НСтр("ru = 'Необходимо выбрать подразделение ассортимента.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоАссортиментуПодразделенияИГруппеНоменклатуры", "ТоварыЗаполнитьПоАссортиментуПодразделения", "Товары", НСтр("ru = 'Заполнить по ассортименту по группе номенклатуры'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаНоменклатуры","Справочник.Номенклатура.Форма.ФормаВыбораГруппы",,, Истина, НСтр("ru = 'Необходимо выбрать группу номенклатуры.'"));
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "Подразделение", "Справочник.ПодразделенияКомпании.ФормаВыбора",,, Истина, НСтр("ru = 'Необходимо выбрать подразделение ассортимента.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоБазовомуАссортиментуПодразделенияИГруппеНоменклатуры", "ТоварыЗаполнитьПоАссортиментуПодразделения", "Товары", НСтр("ru = 'Заполнить по базовому ассортименту по группе номенклатуры'"), ПараметрыКоманды);
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	ПараметрыКоманд.Вставить("ТоварыУстановитьРекомендуемуюНаценку.Видимость",     Истина);
	ПараметрыКоманд.Вставить("ТоварыУстановитьРекомендуемуюНаценку.Доступность",   Истина);
	ПараметрыКоманд.Вставить("ТоварыУстановитьБазовыйАссортимент.Видимость",       Истина);
	ПараметрыКоманд.Вставить("ТоварыУстановитьБазовыйАссортимент.Доступность",     Истина);
	ПараметрыКоманд.Вставить("ТоварыСнятьБазовыйАссортимент.Видимость",            Истина);
	ПараметрыКоманд.Вставить("ТоварыСнятьБазовыйАссортимент.Доступность",          Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьСкладскимиОстатками.Видимость",       Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьСкладскимиОстатками.Доступность",     Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьВсейНоменклатурой.Видимость",         Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьВсейНоменклатурой.Доступность",       Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоГруппеНоменклатуры.Видимость",      Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоГруппеНоменклатуры.Доступность",    Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоПрайсЛисту.Видимость",              Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоПрайсЛисту.Доступность",            Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоГруппеПрайсЛиста.Видимость",        Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоГруппеПрайсЛиста.Доступность",      Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоПрайсЛистуКонтрагента.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоПрайсЛистуКонтрагента.Доступность", Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоСогласованиюЗакупочныхЦен.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоСогласованиюЗакупочныхЦен.Доступность", Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоАссортиментуПодразделения.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоАссортиментуПодразделения.Доступность", Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоБазовомуАссортиментуПодразделения.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоБазовомуАссортиментуПодразделения.Доступность", Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоАссортиментуПодразделенияИГруппеНоменклатуры.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоАссортиментуПодразделенияИГруппеНоменклатуры.Доступность", Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоБазовомуАссортиментуПодразделенияИГруппеНоменклатуры.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоБазовомуАссортиментуПодразделенияИГруппеНоменклатуры.Доступность", Истина);
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения полей таблицы
//
Функция ЗаполнитьТоварныйРеквизит(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ПараметрыЗаполнения.ИмяКоманды = "ТоварыУстановитьРекомендуемуюНаценку" Тогда
		// установим рекомендуемую наценку на всю таблицу
		Для Каждого СтрокаТовар Из Объект.Товары Цикл
			
			Если СтрокаТовар.ПроцентНаценки = СтрокаТовар.РекомендуемыйПроцентНаценки Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТовар.ПроцентНаценки = СтрокаТовар.РекомендуемыйПроцентНаценки;
			ТоварыПроцентНаценкиПриИзменении(Объект, СтрокаТовар, ПараметрыДействия);
			
		КонецЦикла;
	ИначеЕсли ПараметрыЗаполнения.ИмяКоманды = "ТоварыУстановитьБазовыйАссортимент" Тогда
		// установим базовый ассортимент на всю таблицу
		Для Каждого СтрокаТовар Из Объект.Товары Цикл
			СтрокаТовар.БазовыйАссортимент = Истина;
		КонецЦикла;
	ИначеЕсли ПараметрыЗаполнения.ИмяКоманды = "ТоварыСнятьБазовыйАссортимент" Тогда
		// уберем базовый ассортимент со всей таблицы
		Для Каждого СтрокаТовар Из Объект.Товары Цикл
			СтрокаТовар.БазовыйАссортимент = Ложь;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // ЗаполнитьТоварныйРеквизит()

// Обработчик заполнения документа складскими остатками
//
Функция ТоварыЗаполнитьСкладскимиОстатками(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Запрос=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&Момент,СкладКомпании.ПодразделениеКомпании=&ПодразделениеКомпании) КАК ОстаткиТоваровКомпанииОстатки
	|
	|СГРУППИРОВАТЬ ПО Номенклатура
	|");
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Момент",                ?(НЕ ЗначениеЗаполнено(Объект.Ссылка),КонецДня(ТекущаяДатаСеанса()), Новый МоментВремени(Объект.Дата)));
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока              = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
	КонецЦикла;
	
КонецФункции // ТоварыЗаполнитьСкладскимиОстатками()

// Обработчик заполнения документа выбранной группой или всей номенклатурой
//
Функция ТоварыЗаполнитьНоменклатурой(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	Родитель=Неопределено;
	Если ПараметрыЗаполнения.ИмяКоманды="ТоварыЗаполнитьПоГруппеНоменклатуры" Тогда
		Родитель = ПараметрыЗаполнения.ГруппаНоменклатуры;
	КонецЕсли;
	
	Выборка = Справочники.Номенклатура.ВыбратьИерархически(Родитель);
	Товары = Объект.Товары.Выгрузить();
	Пока Выборка.Следующий() Цикл
		// пропустим группы и все что есть в таблице
		Если Выборка.ЭтоГруппа Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Ссылка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор Тогда			
			Для Каждого ТоварИзНабора Из Выборка.СоставНабора Цикл
				Если ТоварИзНабора.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Набор Тогда
					ВывестиСообщение(НСтр("ru = 'В наборе """+СокрЛП(Выборка)+ НСтр("ru = '"" присутствует набор ""'")+СокрЛП(ТоварИзНабора.Номенклатура)+ НСтр("ru = '"". Добавление набора ""'")+СокрЛП(ТоварИзНабора.Номенклатура)+""" отменено.'"));
				Иначе
					// поищем номенклатуру из набора в таблице товаров
					Если Товары.Найти(ТоварИзНабора.Номенклатура,"Номенклатура") <> Неопределено Тогда Продолжить; КонецЕсли;
					
					// добавляем строку
					НоваяСтрока = Объект.Товары.Добавить();
					НоваяСтрока.Номенклатура = ТоварИзНабора.Номенклатура;
					
					// отработаем изменение номенклатуры
					Документы.ИзменениеАссортиментаПодразделения.ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
				КонецЕсли; 
			КонецЦикла;
		Иначе
			
			Если Товары.Найти(Выборка.Ссылка,"Номенклатура") <> Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			// добавляем строку
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура = Выборка.Ссылка;
			
			// отработаем изменение номенклатуры
			Документы.ИзменениеАссортиментаПодразделения.ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции // ТоварыЗаполнитьНоменклатурой()

// Обработчик заполнения документа по прайс-листу
//
Функция ТоварыЗаполнитьПоПрайсЛисту(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	ГруппаПрайсЛиста = Неопределено;
	Если ПараметрыЗаполнения.ИмяКоманды = "ЗаполнитьПоГруппеПрайсЛиста" Тогда
		ГруппаПрайсЛиста = ПараметрыЗаполнения.ГруппаПрайсЛиста;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрайсЛист.Номенклатура
	|ИЗ
	|	Справочник.ПрайсЛист КАК ПрайсЛист
	|ГДЕ
	|	ПрайсЛист.Владелец = &ВидПрайсЛиста
	|"+?(ПараметрыЗаполнения.ИмяКоманды = "ЗаполнитьПоГруппеПрайсЛиста","	И ПрайсЛист.Ссылка В ИЕРАРХИИ(&ГруппаПрайсЛиста)","")+"
	|	И ПрайсЛист.ЭтоГруппа = ЛОЖЬ";
	
	ЗапросПоТоварамПрайсЛиста = Новый Запрос(ТекстЗапроса);
	ЗапросПоТоварамПрайсЛиста.УстановитьПараметр("ВидПрайсЛиста", ПараметрыЗаполнения.ВидПрайсЛиста);
	ЗапросПоТоварамПрайсЛиста.УстановитьПараметр("ГруппаПрайсЛиста", ГруппаПрайсЛиста);
	Выборка = ЗапросПоТоварамПрайсЛиста.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока 				= Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура	= Выборка.Номенклатура;
		ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
	КонецЦикла;
	
КонецФункции // ТоварыЗаполнитьПоПрайсЛисту()

// Обработчик заполнения документа по прайс-листу контрагента
//
Функция ТоварыЗаполнитьПоПрайсЛистуКонтрагента(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	ВалютаЦены = ПараметрыЗаполнения.ПрайсЛистКонтрагента.Валюта;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрайсЛистыКонтрагентов.Номенклатура КАК Номенклатура,
	|	ПрайсЛистыКонтрагентов.Цена КАК Цена,
	|	ПрайсЛистыКонтрагентов.ПроцентНаценки КАК ПроцентНаценки,
	|	ПрайсЛистыКонтрагентов.ЦенаРозничная КАК ЦенаРозничная
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
	|ГДЕ
	|	ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист
	|	И ПрайсЛистыКонтрагентов.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	ЗапросПоТоварамПрайсЛиста = Новый Запрос(ТекстЗапроса);
	ЗапросПоТоварамПрайсЛиста.УстановитьПараметр("ПрайсЛист", ПараметрыЗаполнения.ПрайсЛистКонтрагента);
	Выборка = ЗапросПоТоварамПрайсЛиста.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока 				= Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура	= Выборка.Номенклатура;
		ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока, Неопределено);
		
		НоваяСтрока.Цена			= Выборка.Цена;
		НоваяСтрока.ПроцентНаценки	= Выборка.ПроцентНаценки;
		НоваяСтрока.ЦенаРозничная	= Выборка.ЦенаРозничная;
		
		Если (НоваяСтрока.Цена = 0) И (НоваяСтрока.ПроцентНаценки <> 0) И (НоваяСтрока.ЦенаРозничная <> 0) И (НоваяСтрока.ПроцентНаценки <> -100) Тогда
			НоваяСтрока.Цена = НоваяСтрока.ЦенаРозничная * 100 / (100 + НоваяСтрока.ПроцентНаценки);
		КонецЕсли;
		
		Если НоваяСтрока.Цена = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВалютаЦены) Тогда
			НоваяСтрока.Цена = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(НоваяСтрока.Цена, Объект.ВалютаДокумента, Объект.КурсДокумента, ВалютаЦены, Объект.Дата);
		КонецЕсли;
		
		Если НоваяСтрока.ПроцентНаценки = 0 И (НоваяСтрока.ЦенаРозничная <> 0) Тогда
			ТоварыЦенаРозничнаяПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
		КонецЕсли;
		
		Если НоваяСтрока.ЦенаРозничная = 0 И (НоваяСтрока.ПроцентНаценки <> 0) Тогда
			ТоварыПроцентНаценкиПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции // ТоварыЗаполнитьПоПрайсЛистуКонтрагента()

// Обработчик заполнения документа по согласованию закупочных цен
//
Функция ТоварыЗаполнитьПоСогласованиюЗакупочныхЦен(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Приступим к заполнению ТЧ нашего документа
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СогласованиеЗакупочныхЦен.НомерСтроки КАК НомерСтроки,
	|	СогласованиеЗакупочныхЦен.Номенклатура,
	|	СогласованиеЗакупочныхЦен.Цена,
	|	СогласованиеЗакупочныхЦен.СтавкаНДС
	|ИЗ
	|	Документ.СогласованиеЗакупочныхЦен.Товары КАК СогласованиеЗакупочныхЦен
	|ГДЕ
	|	СогласованиеЗакупочныхЦен.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ПараметрыЗаполнения.СогласованиеЗакупочныхЦен);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВалютаЦены           = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	КоэффициентПересчета = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(1, Объект.ВалютаДокумента, Объект.КурсДокумента, ВалютаЦены, Объект.Дата);
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока 				= Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура	= Выборка.Номенклатура;
		ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока, Неопределено);
		
		Если НоваяСтрока.Цена = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока.Цена = Выборка.Цена*КоэффициентПересчета;
		ТоварыЦенаПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
		
	КонецЦикла;
	
КонецФункции // ТоварыЗаполнитьПоСогласованиюЗакупочныхЦен()

// Обработчик заполнения документа по ассортименту подразделения
//
Функция ТоварыЗаполнитьПоАссортиментуПодразделения(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	ОтборПоНоменклатуре         = Найти(ПараметрыЗаполнения.ИмяКоманды, "ИГруппеНоменклатуры")>0;
	ОтборПоБазовомуАссортименту = Найти(ПараметрыЗаполнения.ИмяКоманды, "ПоБазовомуАссортименту")>0;
	
	// Получаем данные по товарам выбранного подразделенеия
	Запрос=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОграничениеАссортиментаПодразделения.Номенклатура КАК Номенклатура,
	|	ОграничениеАссортиментаПодразделения.Цена КАК Цена,
	|	ОграничениеАссортиментаПодразделения.ПроцентНаценки КАК ПроцентНаценки,
	|	ОграничениеАссортиментаПодразделения.ЦенаРозничная КАК ЦенаРозничная,
	|	ОграничениеАссортиментаПодразделения.СтавкаНДС КАК СтавкаНДС,
	|	ОграничениеАссортиментаПодразделения.БазовыйАссортимент КАК БазовыйАссортимент,
	|	ОграничениеАссортиментаПодразделения.ВидАссортимента КАК ВидАссортимента
	|ИЗ
	|	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&Дата, ПодразделениеКомпании=&ПодразделениеВыбораАссортимента" + ?(ОтборПоНоменклатуре, " И Номенклатура В ИЕРАРХИИ (&ВыбраннаяГруппа)", "") + " И НЕ Номенклатура В (&ТоварыИзменениеАссортиментаПодразделения)) КАК ОграничениеАссортиментаПодразделения
	|ГДЕ
	|	ОграничениеАссортиментаПодразделения.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)" + ?(ОтборПоБазовомуАссортименту, " И 
	|	ОграничениеАссортиментаПодразделения.БазовыйАссортимент = ИСТИНА", "") + "
	|УПОРЯДОЧИТЬ ПО
	|	ОграничениеАссортиментаПодразделения.Номенклатура.Наименование,
	|	ОграничениеАссортиментаПодразделения.Номенклатура
	|");
	//ПараметрыЗаполнения.ИмяКоманды
	//|	ОграничениеАссортиментаПодразделения.БазовыйАссортимент = ИСТИНА
	
	Товары = Объект.Товары.Выгрузить();
	
	Запрос.УстановитьПараметр("ПодразделениеВыбораАссортимента",          ПараметрыЗаполнения.Подразделение);
	Запрос.УстановитьПараметр("ТоварыИзменениеАссортиментаПодразделения", Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Дата", Новый Граница(Объект.ДатаВводаВАссортимент, ВидГраницы.Исключая));
	Если ОтборПоНоменклатуре Тогда
		Запрос.УстановитьПараметр("ВыбраннаяГруппа", ПараметрыЗаполнения.ГруппаНоменклатуры);
	КонецЕсли;
	
	тбТовары = Объект.Товары.Выгрузить();
	тбТовары.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока              = тбТовары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока, Неопределено);
		
		НоваяСтрока.Цена               = Выборка.Цена;
		НоваяСтрока.ПроцентНаценки     = Выборка.ПроцентНаценки;
		НоваяСтрока.ЦенаРозничная      = Выборка.ЦенаРозничная;
		НоваяСтрока.СтавкаНДС          = Выборка.СтавкаНДС;
		НоваяСтрока.БазовыйАссортимент = Выборка.БазовыйАссортимент;
		НоваяСтрока.ВидАссортимента    = Выборка.ВидАссортимента;
	КонецЦикла;
	
	Объект.Товары.Загрузить(тбТовары);
	
КонецФункции // ТоварыЗаполнитьПоАссортиментуПодразделения()

#КонецЕсли
